haskell/Miscellaneous.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Miscellaneous</title>
<!-- 2016-03-24 Thu 05:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Caio Rodrigues" />
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">


</head>
<body>
<div id="content">
<h1 class="title">Miscellaneous</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Miscellaneous</a>
<ul>
<li><a href="#sec-1-1">1.1. Haskell IDEs and Text Editors</a></li>
<li><a href="#sec-1-2">1.2. GHCI configuration file</a></li>
<li><a href="#sec-1-3">1.3. Troubleshooting</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Importing Ambigous Modules in GHCi</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/index.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Miscellaneous</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Haskell IDEs and Text Editors</h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> GHCI configuration file</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The ghci configuration file allows the user to create custom commands and 
customize the ghci shell. The file is in the directory ~/.ghci in Unix systems 
like Linux and OSX.
</p>

<p>
Example: ~/.ghci
</p>

<pre class="example">
import System.Directory ( getCurrentDirectory)
import System.Process (readProcess)

:set -hide-package mtl

:set prompt "\x1b[32m&gt;\x1b[0m " -- set the shell prompt to print λ (lambda)

:def hoogle \s -&gt; return $ ":! hoogle --count=15 \"" ++ s ++ "\""

let xclip_ =  readProcess "xclip" ["-o", "-selection", "clipboard"] ""

let __savePasted = do {  code &lt;-  readProcess "xclip" ["-o", "-selection", "clipboard"] ""  ;  putStrLn 

code ; writeFile "/tmp/haskTemp.hs" code}

let pwd = getCurrentDirectory &gt;&gt;= putStrLn

:def paste (\_ -&gt; __savePasted &gt;&gt; return ":load /tmp/haskTemp.hs" )
:def pwd (\_ -&gt; pwd &gt;&gt; return "")
</pre>

<p>
It requires hoogle to be installed on Linux: (sudo apt-get install
hoogle) on Ubuntu.
</p>

<p>
Examples:
</p>

<pre class="example">
:paste - Paste code block in clipboard and compiles it in ghci
:pwd   - Show Current Directory
</pre>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>pwd
<span class="org-haskell-operator">/</span>home<span class="org-haskell-operator">/</span>tux<span class="org-haskell-operator">/</span><span class="org-haskell-constructor">PycharmProjects</span><span class="org-haskell-operator">/</span><span class="org-haskell-constructor">Haskell</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>hoogle getCurrentDirectory
<span class="org-haskell-constructor">Directory</span> getCurrentDirectory <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">IO</span> <span class="org-haskell-constructor">FilePath</span>
<span class="org-haskell-constructor">System</span><span class="org-haskell-definition">.</span><span class="org-haskell-constructor">Directory</span> getCurrentDirectory <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">IO</span> <span class="org-haskell-constructor">FilePath</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>paste
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Time.Clock</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Time.Calendar</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Time.LocalTime</span>

<span class="org-haskell-definition">main</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
    now <span class="org-haskell-operator">&lt;-</span> getCurrentTime
    timezone <span class="org-haskell-operator">&lt;-</span> getCurrentTimeZone
    <span class="org-haskell-keyword">let</span> zoneNow <span class="org-haskell-operator">=</span> utcToLocalTime timezone now
    <span class="org-haskell-keyword">let</span> (year<span class="org-haskell-operator">,</span> month<span class="org-haskell-operator">,</span> day) <span class="org-haskell-operator">=</span> toGregorian <span class="org-haskell-operator">$</span> localDay zoneNow
    putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Year: "</span> <span class="org-haskell-operator">++</span> show year
    putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Month: "</span> <span class="org-haskell-operator">++</span> show month
    putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Day: "</span> <span class="org-haskell-operator">++</span> show day
[1 <span class="org-haskell-keyword">of</span> 1] <span class="org-haskell-constructor">Compiling</span> <span class="org-haskell-constructor">Main</span>             ( <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>haskTemp<span class="org-haskell-operator">.</span>hs<span class="org-haskell-operator">,</span> interpreted )
<span class="org-haskell-constructor">Ok</span><span class="org-haskell-operator">,</span> modules loaded<span class="org-haskell-constructor">:</span> <span class="org-haskell-constructor">Main</span><span class="org-haskell-operator">.</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> main
<span class="org-function-name">Year</span><span class="org-haskell-definition">:</span> 2015
<span class="org-function-name">Month</span><span class="org-haskell-definition">:</span> 4
<span class="org-function-name">Day</span><span class="org-haskell-definition">:</span> 26
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Troubleshooting</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Importing Ambigous Modules in GHCi</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad.State</span>

<span class="org-haskell-operator">&lt;</span>no location info<span class="org-haskell-operator">&gt;:</span>
    <span class="org-haskell-constructor">Ambiguous</span> <span class="org-haskell-keyword">module</span> name `<span class="org-haskell-constructor">Control.Monad.State</span>'<span class="org-haskell-constructor">:</span>
      it was found <span class="org-haskell-keyword">in</span> multiple packages<span class="org-haskell-constructor">:</span> monads<span class="org-haskell-operator">-</span>tf<span class="org-haskell-operator">-</span>0.1<span class="org-haskell-operator">.</span>0.2 mtl<span class="org-haskell-operator">-</span>2.2<span class="org-haskell-operator">.</span>1
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>set <span class="org-haskell-operator">-</span>hide<span class="org-haskell-operator">-</span>package mtl
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad.State</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Solution: Add the line to ~/.ghci
</p>

<pre class="example">
:set -hide-package mtl
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues</p>
<p class="date">Created: 2016-03-24 Thu 05:53</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>